import { ITimePeriod } from '@/types/types';

export const timePeriods: ITimePeriod[] = [
    {
        startYear: 1983,
        endYear: 1986,
        topic: 'Музыка',
        events: [
            {
                year: 1983,
                text: 'Релиз альбома Майкла Джексона «Thriller», ставшего самым продаваемым в истории музыки.',
            },
            {
                year: 1984,
                text: 'Принс выпускает альбом «Purple Rain» и одноимённый фильм.',
            },
            {
                year: 1985,
                text: 'Международный благотворительный концерт «Live Aid», организованный Бобом Гелдофом, собрал миллионы долларов для помощи Африке.',
            },
            {
                year: 1986,
                text: 'Группа Metallica выпускает культовый альбом «Master of Puppets», ставший значимым для жанра трэш-метал.',
            },
        ],
    },
    {
        startYear: 1987,
        endYear: 1991,
        topic: 'Кино',
        events: [
            {
                year: 1987,
                text: '«Хищник»/Predator, США (реж. Джон Мактирнан)',
            },
            {
                year: 1988,
                text: '«Кто подставил кролика Роджера»/Who framed Roger Rabbit, США (реж. Роберт Земекис)',
            },
            {
                year: 1989,
                text: '«Назад в будущее 2»/Back To  The Future 2, США (реж. Роберт Земекис)',
            },
            {
                year: 1990,
                text: '«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)',
            },
            {
                year: 1991,
                text: '«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)',
            },
        ],
    },
    {
        startYear: 1992,
        endYear: 1997,
        topic: 'Литература',
        events: [
            {
                year: 1992,
                text: 'Нобелевская премия по литературе — Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах».',
            },
            { year: 1994, text: '«Бессонница» — роман Стивена Кинга.' },
            {
                year: 1995,
                text: 'Нобелевская премия по литературе — Шеймас Хини',
            },
            {
                year: 1997,
                text: '«Гарри Поттер и философский камень» — роман Джоан Роулинг.',
            },
        ],
    },
    {
        startYear: 1999,
        endYear: 2004,
        topic: 'Театр',
        events: [
            {
                year: 1999,
                text: 'Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона',
            },
            { year: 2000, text: 'Возобновлено издание журнала «Театр»' },
            {
                year: 2002,
                text: 'Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон',
            },
            {
                year: 2003,
                text: 'В Венеции завершена реконструкция театра «Ла Фениче», пострадавшего при пожаре',
            },
        ],
    },
    {
        startYear: 2011,
        endYear: 2014,
        topic: 'Спорт',
        events: [
            {
                year: 2011,
                text: 'Испания побеждает в финале Чемпионата мира по футболу 2010 года, впервые в своей истории.',
            },
            {
                year: 2012,
                text: 'Олимпийские игры в Лондоне, церемония открытия срежиссирована Дэнни Бойлом.',
            },
            {
                year: 2013,
                text: 'Бразилия выигрывает Кубок конфедераций, обыграв Испанию в финале.',
            },
            {
                year: 2014,
                text: 'Германия становится чемпионом мира по футболу, победив Аргентину в финале.',
            },
        ],
    },
    {
        startYear: 2015,
        endYear: 2022,
        topic: 'Наука',
        events: [
            {
                year: 2015,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: 2016,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: 2017,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
            {
                year: 2018,
                text: 'Старт космического корабля Solar Probe Plus, предназначенного для изучения Солнца',
            },
            {
                year: 2019,
                text: 'Google объявил о создании 53-кубитного квантового компьютера',
            },
            {
                year: 2020,
                text: 'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта',
            },
        ],
    },
];
